Revit 2026 API

# WallSweepGetHostIds Method

---

Gets a list of all host walls on which the sweep resides.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetHostIds()
```
```vb
Public Function GetHostIds As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetHostIds()
```
```fsharp
member GetHostIds : unit -> IList<ElementId>
```

#### Return Value

IListElementId The list of wall ids.

Fixed wall sweeps from vertically compound structures will return only one host element.

#### Reference

WallSweep Class

Autodesk.Revit.DB Namespace